## Production: dynamodb
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_dynamodb_table.audit_logs will be created
  + resource "aws_dynamodb_table" "audit_logs" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "UserID"
      + id               = (known after apply)
      + name             = "AuditLogs"
      + range_key        = "Event#SubjectID#TimeStamp"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_AND_OLD_IMAGES"
      + tags             = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Event#SubjectID#TimeStamp"
          + type = "S"
        }
      + attribute {
          + name = "TimeStamp"
          + type = "N"
        }
      + attribute {
          + name = "UserID"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "UserID"
          + name               = "UserByTime"
          + non_key_attributes = []
          + projection_type    = "KEYS_ONLY"
          + range_key          = "TimeStamp"
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = "arn:aws:kms:ca-central-1:957818836222:key/afbaea67-8277-4a4c-853e-7697dd2dade5"
        }

      + ttl {
          + attribute_name = "ArchiveDate"
          + enabled        = true
        }
    }

  # aws_dynamodb_table.vault must be replaced
-/+ resource "aws_dynamodb_table" "vault" {
      ~ arn              = "arn:aws:dynamodb:ca-central-1:957818836222:table/Vault" -> (known after apply)
      ~ id               = "Vault" -> (known after apply)
        name             = "Vault"
      ~ range_key        = "SubmissionID" -> "NAME_OR_CONF" # forces replacement
      ~ read_capacity    = 0 -> (known after apply)
      ~ stream_arn       = "arn:aws:dynamodb:ca-central-1:957818836222:table/Vault/stream/2022-03-04T14:21:47.167" -> (known after apply)
      - stream_enabled   = true -> null
      ~ stream_label     = "2022-03-04T14:21:47.167" -> (known after apply)
      ~ stream_view_type = "NEW_IMAGE" -> (known after apply)
        tags             = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
      ~ write_capacity   = 0 -> (known after apply)
        # (3 unchanged attributes hidden)

      - attribute {
          - name = "Retrieved" -> null
          - type = "N" -> null
        }
      - attribute {
          - name = "SubmissionID" -> null
          - type = "S" -> null
        }
      + attribute {
          + name = "CreatedAt"
          + type = "N"
        }
      + attribute {
          + name = "NAME_OR_CONF"
          + type = "S"
        }
      + attribute {
          + name = "RemovalDate"
          + type = "N"
        }
      + attribute {
          + name = "Status"
          + type = "S"
        }

      - global_secondary_index {
          - hash_key           = "Retrieved" -> null
          - name               = "retrieved-index" -> null
          - non_key_attributes = [] -> null
          - projection_type    = "ALL" -> null
          - read_capacity      = 0 -> null
          - write_capacity     = 0 -> null
        }
      + global_secondary_index {
          + hash_key           = "FormID"
          + name               = "Status"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "Status"
        }
      + global_secondary_index {
          + hash_key           = "Status"
          + name               = "Archive"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "RemovalDate"
        }
      + global_secondary_index {
          + hash_key           = "Status"
          + name               = "Nagware"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "CreatedAt"
        }

      - ttl {
          - enabled = false -> null
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + dynamodb_audit_logs_arn        = (known after apply)
  + dynamodb_audit_logs_table_name = "AuditLogs"
  ~ dynamodb_vault_arn             = "arn:aws:dynamodb:ca-central-1:957818836222:table/Vault" -> (known after apply)
  - dynamodb_vault_stream_arn      = "arn:aws:dynamodb:ca-central-1:957818836222:table/Vault/stream/2022-03-04T14:21:47.167" -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
